testdata/IN_2023_02/Roundtrip/status/20210419_abgleich_kommunikationsverbindung_2023_02.xml_request_2023_02.xml

<?xml version="1.0" encoding="ISO-8859-1" standalone="no"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <tarif:getQuote xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:basis="http://www.bipro.net/namespace/basis" xmlns:dt="http://www.bipro.net/namespace/datentypen" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:nachr="http://www.bipro.net/namespace/nachrichten" xmlns:partner="http://www.bipro.net/namespace/partner" xmlns:pm="http://www.bipro.net/namespace/produktmodell" xmlns:pm-leben="http://www.bipro.net/namespace/versicherung/produktmodell/leben" xmlns:tarif="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:vbl="urn:de:vb:bipro:taa:leben:1.12" xmlns:vs-pm="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <tarif:Request>
                <nachr:BiPROVersion>2.4.6.1.12</nachr:BiPROVersion>
                <tarif:Tarifierung>
                    <gevo:Vermittler>
                        <allg:Vermittlernummer>777/666</allg:Vermittlernummer>
                        <allg:PartnerID>27555597</allg:PartnerID>
                        <allg:IHKRegistrierungsnummer>D-VSBU-3SFV4-96</allg:IHKRegistrierungsnummer>
                        <allg:Vermittlerrolle>
                            <allg:ArtID>10</allg:ArtID>
                            <allg:Vermittlertyp>02</allg:Vermittlertyp>
                        </allg:Vermittlerrolle>
                    </gevo:Vermittler>
                    <gevo:Vermittler>
                        <allg:Vermittlernummer>999/888</allg:Vermittlernummer>
                        <allg:Vermittlerrolle>
                            <allg:ArtID>01</allg:ArtID>
                            <allg:Vermittlertyp>01</allg:Vermittlertyp>
                        </allg:Vermittlerrolle>
                    </gevo:Vermittler>
                    <tarif:Partner xsi:type="partner:CT_JuristischePerson">
                        <partner:Name>Vermittler Name 1</partner:Name>
                        <partner:Namenszusatz1>Vermittler Name 2</partner:Namenszusatz1>
                        <partner:Partnernummer>Ident-Nr.</partner:Partnernummer>
                        <partner:PartnerID>27555597</partner:PartnerID>
                        <partner:Anschrift>
                            <allg:Strasse>Vermittler Straﬂe</allg:Strasse>
                            <allg:Postleitzahl>99999</allg:Postleitzahl>
                            <allg:Ort>Vermittler Ort</allg:Ort>
                        </partner:Anschrift>
                        <partner:Kommunikationsverbindung>
                            <partner:ArtID>60</partner:ArtID>
                            <partner:Kommunikationsadresse>Vermittler Internet</partner:Kommunikationsadresse>
                        </partner:Kommunikationsverbindung>
                        <partner:Kommunikationsverbindung>
                            <partner:ArtID>50</partner:ArtID>
                            <partner:Kommunikationsadresse>Vermittler E-Mail</partner:Kommunikationsadresse>
                        </partner:Kommunikationsverbindung>
                        <partner:Kommunikationsverbindung>
                            <partner:ArtID>40</partner:ArtID>
                            <partner:Kommunikationsadresse>Vermittler Fax</partner:Kommunikationsadresse>
                        </partner:Kommunikationsverbindung>
                        <partner:Kommunikationsverbindung>
                            <partner:ArtID>20</partner:ArtID>
                            <partner:Kommunikationsadresse>Vermittler Telefon</partner:Kommunikationsadresse>
                        </partner:Kommunikationsverbindung>
                    </tarif:Partner>
                    <tarif:Partner xsi:type="partner:CT_Person">
                        <partner:Anrede>1</partner:Anrede>
                        <partner:Name>VP Name</partner:Name>
                        <partner:PartnerID>29827550</partner:PartnerID>
                        <partner:Anschrift>
                            <allg:Strasse>VP Straﬂe</allg:Strasse>
                            <allg:Postleitzahl>11111</allg:Postleitzahl>
                            <allg:Ort>VP Ort</allg:Ort>
                            <allg:Landname>Deutschland</allg:Landname>
                            <partner:ArtID>1</partner:ArtID>
                        </partner:Anschrift>
                        <partner:Kommunikationsverbindung>
                            <partner:ArtID>50</partner:ArtID>
                            <partner:Kommunikationsadresse>VP E-Mail</partner:Kommunikationsadresse>
                        </partner:Kommunikationsverbindung>
                        <partner:Kommunikationsverbindung>
                            <partner:ArtID>40</partner:ArtID>
                            <partner:Kommunikationsadresse>VP Fax</partner:Kommunikationsadresse>
                        </partner:Kommunikationsverbindung>
                        <partner:Kommunikationsverbindung>
                            <partner:ArtID>20</partner:ArtID>
                            <partner:Kommunikationsadresse>VP Telefon dienstlich</partner:Kommunikationsadresse>
                        </partner:Kommunikationsverbindung>
                        <partner:Kommunikationsverbindung>
                            <partner:ArtID>10</partner:ArtID>
                            <partner:Kommunikationsadresse>VP Telefon privat</partner:Kommunikationsadresse>
                        </partner:Kommunikationsverbindung>
                        <partner:HandeltAufRechnungVon>
                            <partner:PartnerID>1308481333</partner:PartnerID>
                        </partner:HandeltAufRechnungVon>
                        <partner:Vorname>VP Vorname</partner:Vorname>
                        <partner:Geburtsdatum>1992-11-01</partner:Geburtsdatum>
                        <partner:Geschlecht>1</partner:Geschlecht>
                        <partner:Titel>VP Titel</partner:Titel>
                        <partner:Staatsangehoerigkeit>D</partner:Staatsangehoerigkeit>
                        <partner:Ausweis>
                            <partner:Ausweistyp>1</partner:Ausweistyp>
                            <partner:AusstellendeBehoerde>VP Ausweisaussteller</partner:AusstellendeBehoerde>
                            <partner:Ausweisnummer>VP Ausweisnummer</partner:Ausweisnummer>
                        </partner:Ausweis>
                        <partner:Berufstaetigkeit>
                            <partner:Betriebseintritt>2000-01-01</partner:Betriebseintritt>
                        </partner:Berufstaetigkeit>
                    </tarif:Partner>
                    <tarif:Partner xsi:type="partner:CT_JuristischePerson">
                        <partner:PartnerID>1308481333</partner:PartnerID>
                    </tarif:Partner>
                    <tarif:Partner xsi:type="partner:CT_Person">
                        <partner:PartnerID>28237069</partner:PartnerID>
                    </tarif:Partner>
                    <tarif:Versicherungsnehmer>
                        <partner:PartnerID>29827550</partner:PartnerID>
                    </tarif:Versicherungsnehmer>
                    <tarif:Verkaufsprodukt>
                        <pm:Produkt xsi:type="pm-leben:CT_Produkt">
                            <basis:Erweiterung xsi:type="vbl:CT_ProduktErweiterung">
                                <vbl:Tarifgruppe>Normal</vbl:Tarifgruppe>
                            </basis:Erweiterung>
                            <pm:GewuenschteZahlungsweise>8</pm:GewuenschteZahlungsweise>
                            <pm:Versicherungsdauer>
                                <allg:Beginn>2023-03-01T12:00</allg:Beginn>
                            </pm:Versicherungsdauer>
                            <pm:Kennung>IR</pm:Kennung>
                            <pm:Elementarprodukt xsi:type="pm-leben:CT_Rente">
                                <basis:Erweiterung xsi:type="vbl:CT_RenteErweiterung">
                                    <vbl:TodesfallleistungImBezug>IndividuelleGarantiezeit</vbl:TodesfallleistungImBezug>
                                </basis:Erweiterung>
                                <vs-pm:VersicherungssummeOderLeistung>
                                    <vs-pm:ArtID xsi:type="dt:STE_VersicherungssummeOderLeistungBasis">GarantierteRente</vs-pm:ArtID>
                                    <vs-pm:Wert>100</vs-pm:Wert>
                                    <vs-pm:Wertschluessel xsi:type="vbl:STE_LeistungSchluesselErweitert">Klassisch</vs-pm:Wertschluessel>
                                    <vs-pm:Werteinheit>20</vs-pm:Werteinheit>
                                    <vs-pm:Waehrung>EUR</vs-pm:Waehrung>
                                    <vs-pm:Auszahlungsweise>8</vs-pm:Auszahlungsweise>
                                </vs-pm:VersicherungssummeOderLeistung>
                                <pm-leben:IstHauptversicherung>true</pm-leben:IstHauptversicherung>
                                <pm-leben:UeberschussverwendungNachLeistung xsi:type="dt:STE_UeberschussverwendungBasis">14</pm-leben:UeberschussverwendungNachLeistung>
                                <pm-leben:MitversichertePerson>
                                    <partner:PartnerID>28237069</partner:PartnerID>
                                </pm-leben:MitversichertePerson>
                                <pm-leben:VersichertePerson>
                                    <partner:PartnerID>29827550</partner:PartnerID>
                                </pm-leben:VersichertePerson>
                                <pm-leben:BeitragsRueckgewaehrBeiTod>01</pm-leben:BeitragsRueckgewaehrBeiTod>
                                <pm-leben:Garantiezeit>
                                    <allg:AnzahlJahre>5</allg:AnzahlJahre>
                                    <allg:AnzahlMonate>0</allg:AnzahlMonate>
                                </pm-leben:Garantiezeit>
                            </pm:Elementarprodukt>
                            <pm:Elementarprodukt xsi:type="pm-leben:CT_TodesfallAbsicherung">
                                <pm-leben:MitversichertePerson>
                                    <partner:PartnerID>28237069</partner:PartnerID>
                                </pm-leben:MitversichertePerson>
                                <pm-leben:VersichertePerson>
                                    <partner:PartnerID>29827550</partner:PartnerID>
                                </pm-leben:VersichertePerson>
                            </pm:Elementarprodukt>
                            <pm-leben:VorgabeBerechnung>
                                <pm-leben:ArtID xsi:type="dt:STE_VorgabeBerechnungBasis">GarantierteRente</pm-leben:ArtID>
                                <pm-leben:Kontext xsi:type="dt:STE_VorgabeBerechnungKontextBasis">Rente</pm-leben:Kontext>
                            </pm-leben:VorgabeBerechnung>
                        </pm:Produkt>
                    </tarif:Verkaufsprodukt>
                </tarif:Tarifierung>
            </tarif:Request>
        </tarif:getQuote>
    </soapenv:Body>
</soapenv:Envelope>